alwin-middleware-grapescode/alwin-rest/src/test/resources/messages/response/demand/demandsForPaymentPageBothManualAndAutomaticallyCreatedAndBothAbortedAndNot.json

{
  "values": [
    {
      "id": 3,
      "issueDate": 1507672800000,
      "dueDate": 1509663600000,
      "initialInvoiceNo": "000025/10/2024/RL/PO/LW",
      "extCompanyId": 9998,
      "companyName": "Najlepsza Firma Sp. z o.o.",
      "contractNumber": "issue_4_00002/15/1",
      "type": {
        "id": 3,
        "key": "FIRST",
        "dpdStart": 7,
        "numberOfDaysToPay": 3,
        "charge": 50.00,
        "segment": {
          "key": "B",
          "label": "B"
        },
        "minDuePaymentValue": -100.00,
        "minDuePaymentPercent": null
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/12/2017",
      "state": "ISSUED",
      "attachmentRef": "http://grapescode.pl/download/attachment3Link.pdf",
      "invoices": [
        {
          "id": 25,
          "invoiceNumber": "000025/10/2024/RL/PO/LW",
          "contractNumber": "issue_4_00002/15/1",
          "issueDate": 1542322800000,
          "dueDate": 1569967200000,
          "currency": "PLN",
          "netAmount": 1009.10,
          "grossAmount": 1241.20,
          "currentBalance": -1241.20,
          "leoId": 11025
        }
      ],
      "reasonType": null,
      "reasonTypeLabel": null,
      "createdManually": false,
      "manualCreationMessage": null,
      "precedingDemandForPaymentId": null,
      "aborted": false,
      "stateChangeDate": null,
      "stateChangeReason": null,
      "stateChangeOperator": null
    },
    {
      "id": 7,
      "issueDate": 1504216800000,
      "dueDate": 1504476000000,
      "initialInvoiceNo": "Invoice 2",
      "extCompanyId": 9998,
      "companyName": "Najlepsza Firma Sp. z o.o.",
      "contractNumber": "TEST 20/43/12",
      "type": {
        "id": 2,
        "key": "SECOND",
        "dpdStart": 15,
        "numberOfDaysToPay": 3,
        "charge": 99.00,
        "segment": {
          "key": "A",
          "label": "A"
        },
        "minDuePaymentValue": -100.00,
        "minDuePaymentPercent": null
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/07/2017",
      "state": "ISSUED",
      "attachmentRef": "http://grapescode.pl/download/attachment7Link.pdf",
      "invoices": [],
      "reasonType": null,
      "reasonTypeLabel": null,
      "createdManually": true,
      "manualCreationMessage": null,
      "precedingDemandForPaymentId": null,
      "aborted": false,
      "stateChangeDate": null,
      "stateChangeReason": null,
      "stateChangeOperator": null
    },
    {
      "id": 8,
      "issueDate": 1488322800000,
      "dueDate": 1489359600000,
      "initialInvoiceNo": "Invoice 3",
      "extCompanyId": 9997,
      "companyName": "Druga Najlepsza Firma Sp. z o.o.",
      "contractNumber": "TEST 12/34/56",
      "type": {
        "id": 1,
        "key": "FIRST",
        "dpdStart": 7,
        "numberOfDaysToPay": 3,
        "charge": 50.00,
        "segment": {
          "key": "A",
          "label": "A"
        },
        "minDuePaymentValue": -100.00,
        "minDuePaymentPercent": null
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/08/2017",
      "state": "ISSUED",
      "attachmentRef": "http://grapescode.pl/download/attachment8Link.pdf",
      "invoices": [],
      "reasonType": null,
      "reasonTypeLabel": null,
      "createdManually": true,
      "manualCreationMessage": null,
      "precedingDemandForPaymentId": null,
      "aborted": false,
      "stateChangeDate": null,
      "stateChangeReason": null,
      "stateChangeOperator": null
    },
    {
      "id": 12,
      "issueDate": 1485903600000,
      "dueDate": 1486940400000,
      "initialInvoiceNo": "Invoice 3",
      "extCompanyId": 9997,
      "companyName": "Druga Najlepsza Firma Sp. z o.o.",
      "contractNumber": "TEST 12/34/56",
      "type": {
        "id": 1,
        "key": "FIRST",
        "dpdStart": 7,
        "numberOfDaysToPay": 3,
        "charge": 50.00,
        "segment": {
          "key": "A",
          "label": "A"
        },
        "minDuePaymentValue": -100.00,
        "minDuePaymentPercent": null
      },
      "chargeInvoiceNo": "CHARGE/INVOICE/08/2017",
      "state": "ISSUED",
      "attachmentRef": "http://grapescode.pl/download/attachment8Link.pdf",
      "invoices": [],
      "reasonType": null,
      "reasonTypeLabel": null,
      "createdManually": false,
      "manualCreationMessage": null,
      "precedingDemandForPaymentId": null,
      "aborted": true,
      "stateChangeDate": null,
      "stateChangeReason": null,
      "stateChangeOperator": null
    }
  ],
  "totalValues": 4
}